{
    "The lake is the source of the river.": "这个湖是这条河的源头。",
    "The shop assistant always had a smile on her face.": "店员脸上总是挂着笑容。",
    "I usually exercise for a period of time in the afternoon.": "我一般下午会锻炼一段时间。",
    "I learn more from the books in the library than I do in school.": "我从图书馆的书中学到的东西比在学校学到的还多。",
    "Running out of drinking water is quite disturbing for them.": "对于它们来说，缺水是一件非常令人烦恼的事情。",
    "The naked wires could be a potential problem.": "裸露的电线可能是一个潜在的问题。",
    "The brave puppy successfully rescued the kitten trapped in the gap.": "勇敢的小狗成功救出了困在缝隙中的小猫。",
    "The residents here like to interact with each other.": "这里的居民很喜欢互相交流。",
    "The most obvious trait of its appearance is its big nose.": "它外表最明显的特征就是它的大鼻子。",
    "The couple have agreed to get a divorce.": "这对夫妻已同意离婚。",
    "She received an honor for her excellent academic performance.": "她因优异的学业成绩而获得荣誉。",
    "There are 8 major planets in our solar system.": "我们的太阳系有 8 颗主要行星。",
    "He is playing chess with his friend.": "他正在和他的朋友下棋。",
    "Reusable shopping bags are environmentally-friendly.": "可重复使用的购物袋是环保的。",
    "The percentage of the green part is 60%.": "绿色部分占比为60%。",
    "He is thinking about whether a bicycle is affordable for him.": "他正在考虑自己是否买得起一辆自行车。",
    "Different color dustbins have different functions.": "不同颜色的垃圾桶有不同的功能。",
    "Many red lanterns glowed softly in the darkness.": "许多红灯笼在黑暗中发出柔和的光芒。",
    "Noise pollution may impair hearing health.": "噪音污染可能会损害听力健康。",
    "The goods on this ship were imported from overseas.": "这艘船上的货物是从海外进口的。",
    "His mother urged him to do his homework.": "他的母亲催促他做作业。",
    "To save money, he always makes the most .": "为了省钱，他总是尽量省。",
    "economical operation": "经济运行",
    "economical and practical": "经济实用",
    "carrying out": "执行",
    "They are carrying out a medical study in the lab.": "他们正在实验室进行医学研究。",
    "A luxurious drop lamp is hanging on the ceiling.": "天花板上悬挂着一盏奢华的吊灯。",
    "It's unknown where the flying object came from.": "目前还不清楚该飞行物体来自何处。",
    "He had to abandon his car in the desert.": "他不得不把车丢弃在沙漠里。",
    "The dictionary is now in its third edition, which was published in 2017.": "该词典目前为第三版，于 2017 年出版。",
    "He has too much work to do.": "他有太多工作要做。",
    "Driving down the dirt road so fast raised a lot of dust.": "在土路上快速行驶，扬起了不少尘土。",
    "His short arms are his biggest drawback; he's struggling to reach the toilet paper.": "他的手臂较短是最大的缺点；他很难够到卫生纸。",
    "She found a way to get the apple in the fridge.": "她找到了把苹果放进冰箱的方法。",
    "She found Lily's telephone number from the directory.": "她从电话号码簿上找到了莉莉的电话号码。",
    "You always know the answer-give someone else a chance.": "你总是知道答案——给别人一个机会。",
    "as we know": "我们知道",
    "know nothing about": "一无所知",
    "The kitchen is clean and modern.": "厨房干净而现代。",
    "Watching movies on the tablet is my favourite activity.": "在平板电脑上看电影是我最喜欢的活动。",
    "He has been sticking to running for a year.": "他已经坚持跑步一年了。",
    "The child dreads the ghost so much that he couldn't fall asleep.": "这个小孩非常害怕鬼魂，以致无法入睡。",
    "He can see very far.": "他能看得很远。",
    "The dentist could see that her mouth was full of perfect white teeth.": "牙医看到她满嘴都是洁白完美的牙齿。",
    "They have good taste in dressing.": "他们的穿衣品味很好。",
    "The odor of the socks made the girl feel dizzy.": "袜子的气味让女孩感到头晕。",
    "Although I'm a little boy, I'm very talented in math.": "虽然我只是个小男孩，但我却非常有数学天赋。",
    "She's a talented speaker and enjoys talking to a large audience.": "她是一位才华横溢的演说家并且喜欢与广大听众演讲。",
    "The cat in the box may or may not be alive.": "盒子里的猫可能还活着，也可能已经死了。",
    "The girl prefers vegetables to cake.": "比起蛋糕，这个女孩更喜欢蔬菜。",
    "Ladybugs have several black dots on their backs.": "瓢虫的背上有几个黑点。",
    "His departure from home made his family sad.": "他的离去令家人十分悲伤。",
    "Water is vital to living beings.": "水对于生物来说至关重要。",
    "He downloaded files from the Internet.": "他从互联网上下载了文件。",
    "Many people come to this gallery to see the famous pieces of art.": "许多人来到这个画廊观赏著名的艺术作品。",
    "We should recycle trash by putting it into different bins.": "我们应该将垃圾放入不同的垃圾箱进行回收。",
    "Penguins live in the far south.": "企鹅生活在遥远的南方。",
    "She has figured out a good idea.": "她想出了一个好主意。",
    "Her success invited cheers and claps.": "她的成功赢得了欢呼和掌声。",
    "These two men are leaning forward.": "这两个男人身体前倾。",
    "The bottle is bobbing up and down in the waves.": "瓶子在波浪中上下浮动。",
    "This tool can grind the beans into powder.": "这个工具可以把豆子磨成粉。",
    "The boy is measuring the size of the turtle.": "男孩正在测量乌龟的尺寸。",
    "The referee blew the whistle to stop the game.": "裁判吹哨停止比赛。",
    "Look out! You are going to fall into a hole.": "小心！你会掉进洞里的。",
    "please": "请"
}